# CLI toolbelt — shared by laptop (macOS) and remote VM (Linux). `brew bundle`.
# GUI casks (Zed, OrbStack) and codex/claude are handled outside this file.
brew "mise"
brew "uv"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "bat"
brew "eza"
brew "tree"
brew "gh"
brew "starship"
brew "ast-grep"
brew "scc"
brew "yq"
brew "sd"
brew "git-delta"
brew "ruff"
brew "biome"
brew "shellcheck"
brew "shfmt"
brew "just"
brew "watchexec"
brew "entr"
brew "hyperfine"
brew "gitleaks"
brew "xh"
brew "pandoc"
brew "gron"
brew "jj"
brew "tmux"
brew "zellij"
brew "mosh"
brew "neovim"
brew "ttyd"
